perftests/load.yml
execution:
- concurrency: 100
  ramp-up: 100
  hold-for: 10s
  scenario: simple
  
scenarios:
  simple:
    requests:
     - PERFTARGET

reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: perf-plot.xml
  dump-csv: perf-plot.csv
- module: junit-xml
  filename: perf-junit.xml
  data-source: sample-labels