perftests/load.yml
execution:
- concurrency: 5
  executor: selenium
  ramp-up: 1m
  hold-for: 30s
  scenario: reach-home-page-selenium-test

scenarios:
  reach-home-page-selenium-test:
    browser: Firefox
    timeout: 10
    think-time: 1s500ms
    default-address: http://demo.blazemeter.com
    requests:
    - url: /
      assert:
      - contains:
        - blazemeter
        - Trusted
        subject: body
        regexp: false

reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: perf-plot.xml
  dump-csv: perf-plot.csv
- module: junit-xml
  filename: perf-junit.xml
  data-source: sample-labels